<?php

return [

    /*
    |--------------------------------------------------------------------------
    | 默认资产清单
    |--------------------------------------------------------------------------
    |
    | 您可以在此处指定应使用的默认资产清单。
    | 建议将“theme”清单作为默认值，因为它放弃了终极功能
    | 您的应用程序资产对主题的权限。
    |
    */

    'default' => 'theme',

    /*
    |--------------------------------------------------------------------------
    | 资产清单
    |--------------------------------------------------------------------------
    |
    | 清单包含由静态密钥引用的资产列表，这些静态密钥
    | 指向动态位置，例如缓存无效的位置。我们目前
    | 支持两种类型的清单：
    |
    | 资产：key-value，用于将资产与其对应的资产相匹配
    |
    | 捆绑包：一系列用于加载捆绑包的入口点
    |
    */

    'manifests' => [
        'theme' => [
            'path' => get_theme_file_path('public'),
            'url' => get_theme_file_uri('public'),
            'assets' => get_theme_file_path('public/manifest.json'),
            'bundles' => get_theme_file_path('public/entrypoints.json'),
        ],
    ],
];
