<?php

return [

    /*
    |--------------------------------------------------------------------------
    | 默认哈希驱动程序
    |--------------------------------------------------------------------------
    |
    | 此选项控制将用于哈希的默认哈希驱动程序
    | 应用程序的密码。默认情况下，bcrypt 算法为
    | 使用;但是，如果您愿意，您仍然可以自由修改此选项。
    |
    | 支持：“bcrypt”， “argon”， “argon2id”
    |
    */

    'driver' => 'bcrypt',

    /*
    |--------------------------------------------------------------------------
    | Bcrypt 选项
    |--------------------------------------------------------------------------
    |
    | 在这里，您可以指定在以下情况下应使用的配置选项
    | 密码使用 Bcrypt 算法进行哈希处理。这将允许您
    | 来控制对给定密码进行哈希处理所需的时间。
    |
    */

    'bcrypt' => [
        'rounds' => 8,
        'verify' => true,
    ],

    /*
    |--------------------------------------------------------------------------
    | Argon 选项
    |--------------------------------------------------------------------------
    |
    | 在这里，您可以指定在以下情况下应使用的配置选项
    | 密码使用 Argon 算法进行哈希处理。这些将允许您
    | 来控制对给定密码进行哈希处理所需的时间。
    |
    */

    'argon' => [
        'memory' => env('ARGON_MEMORY', 65536),
        'threads' => env('ARGON_THREADS', 1),
        'time' => env('ARGON_TIME', 4),
        'verify' => env('HASH_VERIFY', true),
    ],

    /*
    |--------------------------------------------------------------------------
    | 登录时重新哈希
    |--------------------------------------------------------------------------
    |
    | 将此选项设置为 true 将告诉 Laravel 自动重新哈希
    | 登录期间的用户密码（如果为
    | 算法已更改，允许正常升级哈希。
    |
    */

    'rehash_on_login' => false,

];
