<?php

return [

    /*
    |--------------------------------------------------------------------------
    | 查看存储路径
    |--------------------------------------------------------------------------
    |
    | 大多数模板系统从磁盘加载模板。在这里您可以指定
    | 应检查您的视图的路径数组。当然
    | 通常的查看路径已为您注册。
    |
    */

    'paths' => [
        get_theme_file_path('/ChildTopics/resources/views'),  // 子主题视图路径
        get_theme_file_path('/resources/views'),  // 修改为主题路径
        resource_path('views'),
    ],

    /*
    |--------------------------------------------------------------------------
    | Compiled View Path（编译视图路径）
    |--------------------------------------------------------------------------
    |
    | 此选项确定所有已编译的 Blade 模板的位置
    | 为您的应用程序存储。通常，这是在存储空间中
    | 目录。但是，像往常一样，您可以自由更改此值。
    |
    */
    'compiled' => storage_path('/framework/views'),



    /*
    |--------------------------------------------------------------------------
    | 查看调试器
    |--------------------------------------------------------------------------
    |
    | 启用此选项将显示当前视图名称和数据。给予
    | 'view' 值将仅显示视图名称。给它一个值
    | 'data' 将仅显示当前数据。赋予它任何其他真实值
    | 将显示两者。
    | true/false
    */
    'debug' => true,

];
